BBOOOKK/STM32_car/H题代码(STM32)/Hardware/LED.c
#include "stm32f10x.h"                  // Device header

void LED_Init(void)

{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode= GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_0 |GPIO_Pin_1 ;
	GPIO_InitStructure.GPIO_Speed= GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	GPIO_SetBits(GPIOA,GPIO_Pin_0 |GPIO_Pin_1);
}


void LED_ON(uint8_t number)
{
	if(number==1)
	{
		GPIO_ResetBits(GPIOA,GPIO_Pin_0 );
	}
	if(number==2)
	{
		GPIO_ResetBits(GPIOA,GPIO_Pin_1);
	}
}

void LED1_Turn(void)
{
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_0)==0)
	{
		GPIO_SetBits(GPIOA,GPIO_Pin_0);
		
	}
	else
	{
		GPIO_ResetBits(GPIOA,GPIO_Pin_0);
	}
}
void LED_OFF(uint8_t number)
{
	if(number==1)
	{
		GPIO_SetBits(GPIOA,GPIO_Pin_0 );
	}
	if(number==2)
	{
		GPIO_SetBits(GPIOA,GPIO_Pin_1);
	}	
}
void LED2_Turn(void)
{
	if(GPIO_ReadOutputDataBit(GPIOA,GPIO_Pin_1)==0)
	{
		GPIO_SetBits(GPIOA,GPIO_Pin_1);
		
	}
	else
	{
		GPIO_ResetBits(GPIOA,GPIO_Pin_1);
	}
}
